//Здраствуйте, Татьяна :)

//Задача 1 (10): Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*
int SecondNumber(int x)
{
    int digit1 = x%100;
    int digit2 = digit1/10;
    int result = digit2;
    return result;
}
Console.WriteLine ("Input three-digit number, please");
int num = Convert.ToInt32(Console.ReadLine());
int result = SecondNumber(num);
Console.WriteLine ($"You typed {num} and your second digit is {result} ");
*/
//Задача 2 (13): Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

